Repository: itsproutorgua/olx-killer-monorepo
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Partial profile update example
ru: Пример частичного обновления профиля
uk: Приклад часткового оновлення профілю

source: Delete user profile
ru: Удалить профиль пользователя
uk: Видалити профіль користувача

source: Deactivates the user account and all associated listings. The user data remains in the system for auditing purposes, but the account becomes inaccessible.
ru: Деактивирует учетную запись пользователя и все связанные с ней списки. Данные пользователя остаются в системе для целей аудита, но учетная запись становится недоступной.
uk: Деактивує обліковий запис користувача та всі пов’язані списки. Дані користувачазалишається в системі для цілей аудиту, але обліковий запис стає недоступний.

source: Retrieve user advertisements
ru: Извлечение пользовательских рекламных объявлений
uk: Отримати оголошення користувача

source: Ukrainian
ru: Украинский
uk: Українська

source: English
ru: Английский
uk: Англійська

source: Russian
ru: Русский
uk: Російська

source: Draft
uk: Очікуючі
