Repository: itsproutorgua/olx-killer-monorepo
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Important dates
ru: Важные даты
uk: Важливі дати

source: Status
ru: Состояние
uk: Стан

source: Message
ru: Сообщение
uk: повідомлення

source: Messages
ru: Сообщения
uk: Повідомлення

source: User
ru: Пользователь
uk: Користувач

source: Unauthorized
ru: Несанкционированный
uk: Несанкціонований

source: Access denied
ru: Доступ запрещен
uk: Доступ заборонено

source: Validation errors
ru: Ошибки проверки
uk: Помилки перевірки

source: Invalid category path
ru: Неверный path категории
uk: Недійсний шлях категорії

source: Category not found
ru: Категория не найдена
uk: Категорія не знайдена

source: Query parameters are not allowed on this endpoint.
ru: Параметры запроса не допускаются на этой конечной точке.
uk: Параметри запиту не дозволені на цій кінцевій точці.

source: No Advertisement matches the given query.
ru: Ни одно объявление не соответствует данному запросу.
uk: Жоден оголошення не відповідає даному запиту.

source: Invalid sort field.
ru: Неверное поле sort.
uk: Недійсне поле сортування.

source: Invalid advertisement status. Allowed values are `used` and `new`.
ru: Неверный статус объявления. Допустимые значения: `used` и `new`.
uk: Недійсний статус оголошення. Дозволеними значеннями є `used` і `new`.

source: Invalid parameters.
ru: Неверные параметры.
uk: Недійсні параметри.

source: Invalid file type. Allowed types: %s
ru: Недопустимый тип файла. Разрешенные типы: %s
uk: Недійсний тип файлу. Дозволені типи: %s

source: Uploaded file is not a valid image.
ru: Загруженный файл не является допустимым изображением.
uk: Завантажений файл не є дійсним зображенням.

source: The image size cannot exceed %s MB.
ru: Размер изображения не может превышать %s МБ.
uk: Розмір зображення не може перевищувати %s Мб.

source: Invalid video type. Allowed types: %s
ru: Недопустимый тип видео. Разрешенные типы: %s
uk: Недійсний тип відео. Дозволені типи: %s

source: The video size cannot exceed %s MB.
ru: Размер видео не может превышать %s МБ.
uk: Розмір відео не може перевищувати %s Мб.

source: Each product can have only {settings.VIDEO_UPLOAD_LIMIT} video.
ru: Каждый продукт может иметь только {settings.VIDEO_UPLOAD_LIMIT} видео.
uk: Кожен продукт може мати лише {settings.VIDEO_UPLOAD_LIMIT} відео.

source: Uploaded file is not a valid video.
ru: Загруженный файл не является допустимым видео.
uk: Завантажений файл не є дійсним відеофайлом.

source: Authentication credentials were not provided.
ru: Данные для аутентификации не были предоставлены.
uk: Облікові дані для автентифікації не надано.

source: Create date
ru: Дата создания
uk: Створення дати

source: Update date
ru: Дата обновления
uk: Дата оновлення

source: Favorites
ru: Избранное
uk: Улюблені

source: Product
ru: Продукт
uk: Продукт

source: Favorite
ru: Избранное
uk: Улюблене

source: This product has already been added to your favorites.
ru: Этот товар уже добавлен в избранное.
uk: Цей товар уже додано до ваших улюблених.

source: List favorite items
ru: Список любимых предметов
uk: Список улюблених

source: Returns a list of items that the user has marked as favorites.
ru: Возвращает список элементов, которые пользователь отметил как избранные.
uk: Повертає список елементів, які користувач позначив як улюблені.

source: A list of favorite items for the user.
ru: Список избранных элементов пользователя.
uk: Список улюблених предметів для користувача.

source: Add item to favorites
ru: Добавить элемент в избранное
uk: Додати товар до улюбленого

source: Adds the specified product to the current user's favorites list. Provide the `id` of the product in the request body.
ru: Добавляет указанный продукт в список избранного текущего пользователя. Укажите `id` продукта в теле запроса.
uk: Додає вказаний продукт до списку улюбленого поточного користувача. Укажіть `id` продукту в тілі запиту.

source: The item was successfully added to favorites.
ru: Элемент успешно добавлен в избранное.
uk: Елемент успішно додано до улюбленого.

source: Validation error: product already in favorites.
ru: Ошибка проверки: товар уже в избранном.
uk: Помилка підтвердження: товар вже був доданий до улюбленого.

source: Remove item from favorites
ru: Удалить элемент из избранного
uk: Видалити елемент із улюблених

source: Removes the specified product from the user's favorites list. Use the `id` of the product in the URL.
ru: Удаляет указанный продукт из списка избранного пользователя.Используйте `id` продукта в URL-адресе.
uk: Видаляє вказаний продукт зі списку вибраного користувача.Використовуйте 'id' продукту в URL-адресі.

source: Item successfully removed from favorites.
ru: Элемент успешно удален из избранного.
uk: Елемент успішно видалено з улюблених.

source: The specified favorite item does not exist or was not found.
ru: Указанный избранный элемент не существует или не найден.
uk: Зазначений улюблений елемент не існує або не знайдений.

source: Get favorite products count
ru: Получить количество любимых объявлений
uk: Отримати кількість улюблених оголошень

source: Returns the count of favorite products associated with the current authenticated user.
ru: Возвращает количество избранных продуктов, связанных с текущим аутентифицированным пользователем.
uk: Повертає кількість улюблених оголошень, пов’язаних із поточним автентифікованим користувачем.

source: Successful response containing the favorite count.
ru: Успешный ответ, содержащий количество избранных.
uk: Успішна відповідь із підрахунком улюблених.

source: The number of products marked as favorite by the user.
ru: Количество товаров, отмеченных пользователем как избранные.
uk: Кількість товарів, позначених користувачем як улюблені.

source: Example Response
ru: Пример ответа
uk: Приклад відповіді

source: An example response showing the count of favorite products for the user.
ru: Пример ответа, показывающий количество любимых продуктов пользователя.
uk: Приклад відповіді, що показує кількість улюблених оголошень для користувача.

source: Location
ru: Местоположение
uk: Розташування

source: Region
ru: Область
uk: Область

source: Locations
ru: Местоположения
uk: Розташування

source: City
ru: Город
uk: Місто

source: Cities
ru: Города
uk: Міста

source: Village
ru: Село
uk: Село

source: Location Type
ru: Тип местоположения
uk: Тип розташування

source: Type of location
ru: Тип местоположения
uk: Тип місцезнаходження

source: Latitude
ru: Широта
uk: Широта

source: Longitude
ru: Долгота
uk: Довгота

source: Unknown Location
ru: Неизвестное местоположение
uk: Невідоме місцезнаходження

source: City must be provided for city location type.
ru: Для типа местоположения 'город' необходимо указать город.
uk: Для типу розташування міста необхідно вказати місто.

source: Village must be provided for village location type.
ru: Для типа местоположения 'село' необходимо указать село.
uk: Для типу розташування села необхідно вказати село.

source: Location cannot be both city and village at the same time.
ru: Местоположение не может быть одновременно городом и селом.
uk: Локація не може бути одночасно містом і селом.

source: Regions
ru: Области
uk: Області

source: Village Name
ru: Название села
uk: Назва села

source: Villages
ru: Села
uk: Села

source: Retrieve a list of locations
ru: Получить список местоположений
uk: Отримати список місць

source: Filter locations by name (supports partial match for city or village names)
ru: Фильтрация местоположений по названию (поддерживает частичное совпадение названий городов и деревень)
uk: Фільтруйте локації за назвою (підтримується часткове співпадіння для назв міст або сіл)

source: A list of locations successfully retrieved.
ru: Список успешно полученных местоположений.
uk: Список локацій успішно отримано.

source: Invalid request parameters.
ru: Неверные параметры запроса.
uk: Невірні параметри запиту.

source: An unexpected error occurred on the server.
ru: На сервере произошла непредвиденная ошибка.
uk: Сталася непередбачена помилка на сервері.

source: Number of Products
ru: Количество продуктов
uk: Кількість оголошень

source: Popular Categories
ru: Популярные категории
uk: Популярні категорії

source: Popular sellers
ru: Популярные продавцы
uk: Популярні продавці

source: Top-10 sellers
ru: Топ-10 продавцов
uk: Топ-10 продавців

source: General
ru: Основной
uk: Основний

source: Set status to New for selected products
ru: Установить статус «Новый» для выбранных продуктов
uk: Встановити стан 'Новий' для обраних оголошень

source: Set status to Used for selected products
ru: Установить статус «Бэушный» для выбранных продуктов
uk: Встановити стан 'Вживаний' для обраних оголошень

source: Status of selected products has been set to 'Used'.
ru: Установить статус «Бэушный» для выбранных продуктов

source: Products
ru: Продукты
uk: Оголошення

source: Category name
ru: Название категории
uk: Назва категорії

source: Parent category
ru: Родительская категория
uk: Батьківська категорія

source: Image
ru: Изображение
uk: Зображення

source: Icon
ru: Иконка
uk: Іконка

source: Views
ru: Просмотры
uk: Перегляди

source: Category
ru: Категория
uk: Категорія

source: Categories
ru: Категории
uk: Категорії

source: Filter
ru: Фильтр
uk: фільтр

source: Filters
ru: Фильтры
uk: Фільтри

source: Option for {self.filter}
ru: Вариант для {self.filter}
uk: Варіант для {self.filter}

source: Filter value
ru: Значение фильтра
uk: Значення фільтра

source: Filter values
ru: Фильтр значений
uk: Значення фільтра

source: Currency code
ru: Код валюты
uk: Код валюти

source: Currency symbol
ru: Символ валюты
uk: Символ валюти

source: Currency name
ru: Название валюты
uk: Назва валюти

source: Currency
ru: Валюта
uk: Валюта

source: Currencies
ru: Валюты
uk: Валюти

source: Must be greater than or equal to {MIN_PRICE}.
ru: Должно быть больше или равно {MIN_PRICE}.
uk: Має бути більше або дорівнювати {MIN_PRICE}.

source: Amount
ru: Сумма
uk: Сума

source: Price
ru: Цена
uk: Ціна

source: Prices
ru: Цены
uk: Ціни

source: New
ru: Новый
uk: Новий

source: Used
ru: Бэушный
uk: Вживаний

source: Active
ru: Активный
uk: Активні

source: Inactive
ru: Неактивный
uk: Неактивні

source: Rejected
ru: Отклонено
uk: Відхилені

source: Product name
ru: Название продукта
uk: Назва продукту

source: Product description
ru: Описание продукта
uk: Опис товару

source: Seller
ru: Продавец
uk: Продавець

source: Parameters
ru: Параметры
uk: Параметри

source: Allowed image formats: %s
ru: Разрешенные форматы изображений: %s
uk: Дозволені формати зображень: %s

source: Product Image
ru: Изображение продукта
uk: Зображення продукту

source: Product Images
ru: Изображения продукта
uk: Зображення продукту

source: Video
ru: Видео
uk: Відео

source: Allowed video formats: %s
ru: Разрешенные форматы видео: %s
uk: Дозволені формати відео: %s

source: Product Videos
ru: Видео продуктов
uk: Відео продукту

source: Invalid currency specified.
ru: Указана неверная валюта.
uk: Вказана недійсна валюта.

source: Failed to create price: {}
ru: Не удалось создать цену: {}
uk: Не вдалося створити ціну: {}

source: Failed to create product price: {}
ru: Не удалось создать цену продукта: {}
uk: Не вдалося створити ціну продукту: {}

source: Failed to create product prices: {}
ru: Не удалось создать цены на продукты: {}
uk: Не вдалося створити ціни на продукти: {}

source: Failed to create product images: {}
ru: Не удалось создать изображения продукта: {}
uk: Не вдалося створити зображення: {}

source: The product does not exist.
ru: Товар не существует.
uk: Товар не існує.

source: Failed to create product image: {}
ru: Не удалось создать изображение продукта: {}
uk: Не вдалося створити зображення продукту: {}

source: Product must be provided.
ru: Продукт должен быть предоставлен.
uk: Продукт повинен бути наданий.

source: Each product can have only one video.
ru: Каждый продукт может иметь только одно видео.
uk: Кожен продукт може мати лише одне відео.

source: Failed to create video: %s
ru: Не удалось создать видео: %s
uk: Не вдалося створити відео: %s

source: Failed to update video: %s
ru: Не удалось обновить видео: %s
uk: Не вдалося оновити відео: %s

source: List categories in a tree structure
ru: Список категорий в древовидной структуре
uk: Список категорій у структурі дерева

source: Retrieve a hierarchical tree of categories.
ru: Получить иерархическое дерево категорий.
uk: Отримати ієрархічне дерево категорій.

source: Returned when query parameters are passed in the request.
ru: Возвращается, когда в запросе передаются параметры запроса.
uk: Повертається, коли в запиті передаються параметри запиту.

source: Retrieve a category by path
ru: Получить категорию по path
uk: Отримати категорію за path

source: Retrieve a single category by path
ru: Получить одну категорию по path
uk: Отримати одну категорію за path

source: Retrieve a list of all currencies
ru: Получить список всех валют
uk: Отримати список усіх валют

source: Returns a list of available currencies with their code, symbol, and name.
ru: Возвращает список доступных валют с их кодом, символом и названием.
uk: Повертає список доступних валют із їхніми кодами, символами та назвами.

source: Create a product
ru: Создать продукт
uk: Створіть продукт

source: Create a new product with the provided data
ru: Создайте новый продукт с предоставленными данными
uk: Створіть новий продукт із наданими даними

source: Retrieve a product
ru: Получить продукт
uk: Отримати товар

source: Retrieve a single product by slug
ru: Получить один продукт по slug
uk: Отримайте один продукт за допомогою slug

source: Update a product
ru: Обновить продукт
uk: Оновити продукт

source: Update a product with the provided data
ru: Обновите продукт с предоставленными данными
uk: Оновіть продукт за допомогою наданих даних

source: Partial update a product
ru: Частичное обновление продукта
uk: Часткове оновлення продукту

source: Partial update a product with the provided data
ru: Частичное обновление продукта с предоставленными данными
uk: Часткове оновлення продукту за допомогою наданих даних

source: Delete a product
ru: Удалить продукт
uk: Видалити товар

source: Delete a product by slug
ru: Удалить продукт по slug
uk: Видалення товару за slug

source: Filter products by various parameters
ru: Фильтровать товары по различным параметрам
uk: Фільтрувати товари за різними параметрами

source: Retrieve a list of products filtered by multiple parameters
ru: Получить список продуктов, отфильтрованных по нескольким параметрам
uk: Отримати список оголошень, відфільтрованих за кількома параметрами

source: Filter products by category path
ru: Фильтровать продукты по category path
uk: Фільтруйте продукти за path категорії

source: Minimum price filter
ru: Фильтр минимальной цены
uk: Фільтр мінімальної ціни

source: Maximum price filter
ru: Фильтр максимальной цены
uk: Фільтр максимальної ціни

source: Field to sort products by (e.g., {", ".join(allowed_sort_fields)})
ru: Поле для сортировки объявлений (например, {
uk: Поле для сортування оголошень (наприклад, {", ".join(allowed_sort_fields)})

source: Sort by price in ascending order
ru: Сортировать по цене в порядке возрастания
uk: Сортувати за ціною в порядку зростання

source: Sort products by price in ascending order.
ru: Сортировать товары по цене в порядке возрастания.
uk: Сортуйте товари за ціною в порядку зростання.

source: Sort by price in descending order
ru: Сортировать по цене в порядке убывания
uk: Сортувати за ціною в порядку спадання

source: Sort products by price in descending order.
ru: Сортировать товары по цене в порядке убывания.
uk: Сортуйте товари за ціною в порядку спадання.

source: Sort by created date in descending order
ru: Сортировать по дате создания в порядке убывания
uk: Сортувати за датою створення в порядку спадання

source: Sort products by created date in descending order.
ru: Сортировать продукты по дате создания в порядке убывания.
uk: Сортуйте товари за датою створення в порядку спадання.

source: List of latest products
ru: Список недавно добавленных продуктов
uk: Список нещодавно доданих оголошень

source: Retrieve a list of the latest products with an option to limit the number of results (10 to 50).
ru: Получить список недавно добавленных продуктов с возможностью ограничения количества результатов (от 10 до 50).
uk: Отримати список нещодавно доданих оголошень із можливістю обмеження кількості результатів (від 10 до 50).

source: The maximum number of products to retrieve, between 10 and 50. Default is 10.
ru: Максимальное количество извлекаемых продуктов: от 10 до 50. Значение по умолчанию — 10.
uk: Максимальна кількість оголошень, що витягуються: від 10 до 50. Значення за замовчуванням — 10.

source: User Email
ru: Электронная почта пользователя
uk: Електронна пошта користувача

source: Personal info
ru: Личная информация
uk: Особиста інформація

source: Permissions
ru: Разрешения
uk: Дозволи

source: Profile link
ru: Ссылка на профиль
uk: Посилання на профіль

source: View Profile
ru: Просмотреть профиль
uk: Переглянути профіль

source: Passwords do not match.
ru: Пароли не совпадают.
uk: Паролі не збігаються.

source: Users
ru: Пользователи
uk: Користувачі

source: Failed to fetch JWKS
ru: Не удалось получить JWKS
uk: Не вдалося отримати JWKS

source: Token has expired
ru: Срок действия токена истек
uk: Термін дії маркера закінчився

source: Invalid token audience
ru: Недействительный токен аудитории
uk: Недійсна token audience

source: Invalid token issuer
ru: Недействительный эмитент токена
uk: Недійсний token issuer

source: Error decoding token
ru: Ошибка декодирования токена
uk: Помилка декодування token

source: Invalid token
ru: Недействительный токен
uk: Недійсний token

source: Token validation failed
ru: Проверка токена не удалась
uk: Помилка перевірки Token

source: Token is missing required claim: {claim}
ru: Отсутствует токен, требуемое требование: {claim}
uk: У Token відсутня необхідна заявка: {claim}

source: Authorization header must start with 'Bearer'
ru: Заголовок авторизации должен начинаться с «Bearer»
uk: Заголовок авторизації має починатися з "Bearer"

source: Authorization header is improperly formatted
ru: Заголовок авторизации неправильно отформатирован
uk: Заголовок авторизації відформатовано неправильно

source: Token does not contain 'email' field
ru: Токен не содержит поля «email»
uk: Token не містить поля 'email'.

source: User is inactive
ru: Пользователь неактивен
uk: Користувач неактивний

source: JWT authentication via Auth0
ru: Аутентификация JWT через Auth0
uk: Аутентифікація JWT через Auth0

source: The Email must be set
ru: Необходимо указать адрес электронной почты.
uk: Необхідно встановити електронну пошту

source: Superuser must have is_staff=True.
ru: Суперпользователь должен иметь is_staff=True.
uk: Суперкористувач повинен мати is_staff=True.

source: Superuser must have is_superuser=True.
ru: Суперпользователь должен иметь is_superuser=True.
uk: Суперкористувач повинен мати is_superuser=True.

source: profile picture
ru: фотография профиля
uk: зображення профілю

source: Upload a profile picture.
ru: Загрузите фотографию профиля.
uk: Завантажте зображення профілю.

source: This field allows you to specify the user's city and region.
ru: В этом поле можно указать город и регион пользователя.
uk: У цьому полі можна вказати місто та регіон користувача.

source: Authentication Providers
ru: Поставщики аутентификации
uk: Постачальники автентифікації

source: Specifies the authentication providers linked to the user account.
ru: Указывает поставщиков аутентификации, связанных с учетной записью пользователя.
uk: Визначає постачальників автентифікації, пов’язаних з обліковим записом користувача.

source: Phone numbers
ru: Номера телефонов
uk: Номери телефонів

source: You can add multiple phone numbers.
ru: Вы можете добавить несколько номеров телефонов.
uk: Ви можете додати кілька телефонних номерів.

source: Profile
ru: Профиль
uk: Профіль

source: Profiles
ru: Профили
uk: Профілі

source: username
ru: Псевдоним
uk: Псевдонім

source: Required. 150 characters or fewer. Letters, digits and @/./+/-/_ only.
ru: Обязательно. Не более 150 символов. Только буквы, цифры и @/./+/-/_.
uk: Обов'язковий. 150 символів або менше. Лише літери, цифри та @/./+/-/_.

source: first name
ru: имя
uk: ім'я

source: last name
ru: фамилия
uk: прізвище

source: email address
ru: Адрес электронной почты
uk: адреса електронної пошти

source: email confirm
ru: подтверждение по электронной почте
uk: підтвердження електронної пошти

source: Indicates whether the user has verified their email address.
ru: Указывает, подтвердил ли пользователь свой адрес электронной почты.
uk: Вказує, чи підтвердив користувач свою електронну адресу.

source: staff status
ru: статус персонала
uk: статус персоналу

source: Designates whether the user can log into this admin site.
ru: Определяет, может ли пользователь войти на этот сайт администратора.
uk: Визначає, чи може користувач увійти на цей сайт адміністратора.

source: active
ru: активный
uk: активний

source: Designates whether this user should be treated as active. Unselect this instead of deleting accounts.
ru: Определяет, следует ли считать этого пользователя активным. Снимите этот флажок вместо удаления учетных записей.
uk: Визначає, чи слід розглядати цього користувача як активного. Зніміть цей прапорець замість того, щоб видаляти облікові записи.

source: date joined
ru: дата присоединения
uk: дата приєднання

source: A list of phone numbers (as strings).
ru: Список телефонных номеров (в виде строк).
uk: Список телефонних номерів (у вигляді рядків).

source: A location ID.
ru: ID местоположения.
uk: Ідентифікатор місцезнаходження.

source: Invalid location ID.
ru: Неверный ID местоположения.
uk: Недійсний ідентифікатор місця

source: Expected a list of phone numbers.
ru: Ожидался список телефонных номеров.
uk: Очікується список телефонних номерів.

source: User profile management
ru: Управление профилем пользователя
uk: Керування профілем користувача

source: Endpoint for managing the current user's profile, including retrieval, updating, and deletion.
ru: Конечная точка для управления профилем текущего пользователя, включая извлечение, обновление и удаление.
uk: Посилання для керування профілем поточного користувача, включаючи пошук, оновлення та видалення.

source: Profile not found or access denied.
ru: Профиль не найден или доступ запрещен.
uk: Профіль не знайдено або доступ заборонено.

source: You do not have permission to edit this profile.
ru: У вас нет прав на редактирование этого профиля.
uk: Ви не маєте дозволу редагувати цей профіль.

source: The account was deleted by the {instance.user}.
ru: Учетная запись была удалена пользователем {instance.user}.
uk: Обліковий запис видалено {instance.user}.

source: Retrieve user profile
ru: Получить профиль пользователя
uk: Отримати профіль користувача

source: Retrieve the profile of the currently authenticated user.
ru: Получить профиль текущего аутентифицированного пользователя.
uk: Отримати профіль поточного автентифікованого користувача.

source: Example profile response
ru: Пример ответа профиля
uk: Приклад response профілю

source: Update user profile
ru: Обновить профиль пользователя
uk: Оновити профіль користувача

source: Update the profile of the currently authenticated user.
ru: Обновите профиль текущего аутентифицированного пользователя.
uk: Оновіть профіль поточного автентифікованого користувача.

source: Complete profile update example
ru: Пример полного обновления профиля
uk: Повний приклад оновлення профілю

source: Partially update user profile
ru: Частично обновить профиль пользователя
uk: Частково оновити профіль користувача

source: Partially update the profile of the currently authenticated user.
ru: Частично обновить профиль текущего аутентифицированного пользователя.
uk: Частково оновити профіль поточного автентифікованого користувача.
